Scr/Documents/ро_ПриходОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ро_ПриходОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстатокРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТНвходящий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрИдентификаторСкладаR3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефоныПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопроводительныеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролерСТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОбработкиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогПроверил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Comment>-</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОборудования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокЗаказНаряд</Name>
							<Comment>-</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСкладаR3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_ИдентификаторСкладаЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборудованиеПримечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>масса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Scr/AccumulationRegisters/ОстатокРО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстатокРО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Кол</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Scr/Documents/ро_ПриходОборудования/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Ответственный) = Ложь Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;
	Если ЗначениеЗаполнено(Организация) = Ложь Тогда
		Организация = Константы.ОсновнаяОрганизация.Получить();
	КонецЕСЛИ;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Т = Оборудования.Выгрузить(,"ИдентификаторСкладаR3");
	Т.свернуть("ИдентификаторСкладаR3","");
	Стр = "";
	Для каждого С из Т ЦИкл
		Стр = Стр+С.ИдентификаторСкладаR3+" ";
	КонецЦИкла;
	Если СокрЛП(Стр) = "" Тогда
		стрИдентификаторСкладаR3 = СокрЛП(ПунктПогрузки);
	Иначе
		стрИдентификаторСкладаR3 = СокрЛП(Стр);
	КонецЕсли;
	
	КоличествоПозиций =  Оборудования.Количество();
	
КонецПроцедуры


Процедура ПроверитьРеквизитыЗаказНаряда(сс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_ПриходОборудованияОборудования.ДокЗаказНаряд КАК ДокЗаказНаряд,
	               |	ро_ПриходОборудованияОборудования.Оборудование КАК Оборудование,
	               |	ро_ПриходОборудованияОборудования.НомерОборудования КАК НомерОборудования,
	               |	ро_ПриходОборудованияОборудования.ИнвНомер КАК ИнвНомер,
	               |	ро_ПриходОборудованияОборудования.ОборудованиеПримечание КАК ОборудованиеПримечание,
	               |	ро_ПриходОборудованияОборудования.Плательщик КАК Плательщик,
	               |	ро_ПриходОборудованияОборудования.Ссылка.Контрагент КАК Контрагент,
	               |	ро_ПриходОборудованияОборудования.Ссылка.НомерТТНвходящий КАК НомерТТНвходящий,
	               |	ро_ПриходОборудованияОборудования.масса КАК масса,
	               |	CASE WHEN ро_ПриходОборудованияОборудования.ИдентификаторСкладаR3 = Значение(Справочник.ро_ИдентификаторСкладаЗаказчика.ПустаяСсылка)
				   |         THEN ро_ПриходОборудованияОборудования.Ссылка.ПунктПогрузки
				   |         ELSE ро_ПриходОборудованияОборудования.ИдентификаторСкладаR3
				   |         END КАК ИдентификаторСкладаR3
	               |ИЗ
	               |	Документ.ро_ПриходОборудования.Оборудования КАК ро_ПриходОборудованияОборудования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.роЗаказНаряд КАК роЗаказНаряд
	               |		ПО ро_ПриходОборудованияОборудования.ДокЗаказНаряд = роЗаказНаряд.Ссылка
	               |ГДЕ
	               |	ро_ПриходОборудованияОборудования.Ссылка = &Ссылка
	               |	И  (
				   |         ро_ПриходОборудованияОборудования.Оборудование <> роЗаказНаряд.Оборудование
	               |	  or ро_ПриходОборудованияОборудования.НомерОборудования <> роЗаказНаряд.НомерОборудования
	               |	  or ро_ПриходОборудованияОборудования.ИнвНомер <> роЗаказНаряд.ИнвНомер
	               |	  or ро_ПриходОборудованияОборудования.Плательщик <> роЗаказНаряд.Плательщик
	               |	  or ро_ПриходОборудованияОборудования.ссылка.Контрагент <> роЗаказНаряд.Контрагент
	               |	  or ро_ПриходОборудованияОборудования.ссылка.НомерТТНвходящий <> роЗаказНаряд.НомерТТНвходящий
	               |	  or ро_ПриходОборудованияОборудования.ИдентификаторСкладаR3 <> роЗаказНаряд.ИдентификаторСкладаR3
	               |	  or ро_ПриходОборудованияОборудования.ОборудованиеПримечание <> роЗаказНаряд.ОборудованиеПримечание
	               |	  or ро_ПриходОборудованияОборудования.масса <> роЗаказНаряд.масса
	               |	  or (роЗаказНаряд.Статус = &ПредСтатус)
				   |     )
				   |";
	Запрос.УстановитьПараметр("ссылка",сс);
	Запрос.УстановитьПараметр("ПредСтатус",Справочники.ро_Статусы.ПустаяСсылка());
	Тбл = Запрос.Выполнить().Выгрузить();
	Для каждого Стр из Тбл Цикл
		Документы.роЗаказНаряд.ОбновитьДанныеДокумента(Стр.ДокЗаказНаряд,Стр,Справочники.ро_Статусы.ПустаяСсылка(),Справочники.ро_Статусы.ВРаботе);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Проведен=Ложь Тогда Возврат; КонецЕсли;
	
	Есть = Ложь;
	Для каждого Стр из Оборудования Цикл
		Если ЗначениеЗаполнено(Стр.ДокЗаказНаряд) =Ложь Тогда
			Стр.ДокЗаказНаряд = Документы.роЗаказНаряд.ДокументСоздатьПоПараметрам(Стр,Ссылка,Справочники.ро_Статусы.ПустаяСсылка(),Справочники.ро_Статусы.ВРаботе);
			есть=Истина;
		КонецеслИ;
	КонецЦикла;
	
	Если Есть Тогда 
		Записать(); 
	КонецЕсЛИ;
	
	ПроверитьРеквизитыЗаказНаряда(Ссылка);
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстатокРО.Записать();
	Если Дата < Дата(2020,12,30) Тогда Возврат; КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_ОтгрузкаЗаказНаряды.ДокЗаказНаряд КАК ЗаказНаряд,
	               |	ро_ОтгрузкаЗаказНаряды.Ссылка.Дата КАК Период,
	               |	1 КАК Кол
	               |ИЗ
	               |	Документ.ро_ПриходОборудования.Оборудования КАК ро_ОтгрузкаЗаказНаряды
	               |ГДЕ
	               |	ро_ОтгрузкаЗаказНаряды.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	ТБл = Запрос.Выполнить().Выгрузить();
	
	Движения.ОстатокРО.Загрузить(Тбл);
	Движения.ОстатокРО.Записать();
	
КонецПроцедуры
